RearWingModifiedAdjoint/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solver volumetricBSplinesMotionSolver;

volumetricBSplinesMotionSolverCoeffs
{
    box
    {
        type    cartesian;
        nCPsU   7;
        nCPsV   7;
        nCPsW   4;
        degreeU 3;
        degreeV 3;
        degreeW 3;

        controlPointsDefinition axisAligned;
	lowerCpBounds		(-0.1 -0.45 -0.25);
	upperCpBounds		(0.45 0.45 0.25);

        confineUMovement false;
        confineVMovement true;
        confineWMovement false;
        confineBoundaryControlPoints false;

        confineUMinCPs ( (true true true) );
        confineUMaxCPs ( (true true true) );
        confineVMinCPs ( (true true true) );
        confineVMaxCPs ( (true true true) );
        confineWMinCPs ( (true true true) );
        confineWMaxCPs ( (true true true) );
    }
}

// ************************************************************************* //
